// Напишите программу которая на вход принимает число и выдает его квадрат
Console.WriteLine("Enter the num >");

int x = int.Parse(Console.ReadLine());

Console.WriteLine(x * x);
