// Напишите программу которая на вход принимает число и выдает
// является ли число четным.

Console.WriteLine("Please eneter num >");
int x = int.Parse(Console.ReadLine());
if (x % 2 == 0) Console.WriteLine("Yes");
else Console.WriteLine("No");
